cases/openfoam/fluids/lid_driven_cavity_re100/solution/case/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat       raw;

fields
(
    U
);

sets
(
    // Vertical centre-line line, 121 points from y=0 to y=1 at x=0.5.
    centerline_x0p5
    {
        type    uniform;
        axis    y;
        start   (0.5 0.001 0.5);
        end     (0.5 0.999 0.5);
        nPoints 121;
    }
);
